UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_Механизмы/рар_мп_Механизмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рар_мп_Механизмы</name>
</mdclass:DataProcessor>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/DataProcessors/рар_мп_Механизмы/Forms/Форма/Module.bsl
#Область СлужебныеПроцедурыИФункцииДляПроверкиПЛС

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПриПовторномОткрытииНаСервере()
	Возврат Константы.рар_мп_Согласие.Получить();
КонецФункции

&НаКлиенте
Процедура ПриПовторномОткрытии()
	Если ПриПовторномОткрытииНаСервере() = Ложь Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = НСтр("ru='Вы не приняли лицензионное соглашение 1С-Рарус, функционал расширения не доступен'");
		Сообщение.Сообщить();
		ЭтотОбъект.Закрыть();
	КонецЕсли;
КонецПроцедуры  

#КонецОбласти
 
#Область ЗагрузкаЗаказов

 &НаСервере
Функция ЗагрузкаЗаказовНаСервере()
	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "рар_мп_ЗагрузкаЗаказов.Ozon_ЗагрузкаЗаказов");
	
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "рар_мп_ЗагрузкаЗаказов.Wildberries_ЗагрузкаЗаказов");
	
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "рар_мп_ЗагрузкаЗаказов.ЯндексМаркет_ЗагрузкаЗаказов");
	
	КонецЕсли;
	
	Возврат ВозвратныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузкаЗаказов(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		
		ДлительнаяОперация     = ЗагрузкаЗаказовНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	    ПараметрыОжидания.ВыводитьСообщения = Истина;
	    ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	    ПараметрыОжидания.ТекстСообщения = "Получение информации о заказах...";                                    
	    Оповещение = Новый ОписаниеОповещения("ЗавершениеПолученияЗаказов", ЭтотОбъект);
	    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);	
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПолученияЗаказов(Результат, СтруктураПараметров) Экспорт

	 Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
	
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Загрузка заказов завершена";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры


#КонецОбласти  

#Область ОбновлениеОстатков 

 &НаСервере
Функция ОбновитьОстаткиНаСервере()
	 	
	Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "рар_мп_ОбновлениеОстатков.Ozon_ОбновлениеОстатков");
	
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "рар_мп_ОбновлениеОстатков.Wildberries_ОбновлениеОстатков");
	
	ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда
		
		ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
		
		ВозвратныеДанные = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, "рар_мп_ОбновлениеОстатков.ЯндексМаркет_ОбновлениеОстатков");
	
	КонецЕсли;
	
	Возврат ВозвратныеДанные;

	
КонецФункции

&НаКлиенте
Процедура ОбновитьОстатки(Команда) 
	
	Если ПроверитьЗаполнение() Тогда
		
		ДлительнаяОперация     = ОбновитьОстаткиНаСервере();
		ПараметрыОжидания      = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	    ПараметрыОжидания.ВыводитьСообщения = Истина;
	    ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	    ПараметрыОжидания.ТекстСообщения = "Передача остатков на маркетплейсы...";                                    
	    Оповещение = Новый ОписаниеОповещения("ЗавершениеПередачиОстатков", ЭтотОбъект);
	    ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеПередачиОстатков(Результат, СтруктураПараметров) Экспорт

	 Если Результат = НЕОПРЕДЕЛЕНО Тогда
	
		Возврат;	
	
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		
		СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
		
		Возврат;
	
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Передача остатков завершена";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
